{
  "title": "Skills",
  "headline": "Capability Columns",
  "sub": {
    "classifieds": {
      "title": "Hard Skills and Soft Skills",
      "headline": "Classifieds",
      "technical": {
        "title": "Technical Skills",
        "headline": "Services Offered",
        "items": [
          {
            "heading": "Need a <b>BACKEND DEVELOPER</b>?",
            "content": "Clean APIs with <bi>thorough validation</bi> and solid system foundations using clean code. Documentation included. <b>Contact immediately!</b>"
          },
          {
            "heading": "TOTAL FULL-STACK SOLUTIONS!",
            "content": "From the front-end to the back-end database, everything is covered. <bi>Seamless integration</bi>, responsive design, & clean code. <b>One hand for all your digital needs!</b>"
          },
          {
            "heading": "DOCUMENTATION... a mess?",
            "content": "Accepting <b>Technical Writing</b> assignments. Transform complex code into easy-to-understand guides. API docs, system manuals, to workflow documentation. <bi>Clear, neat, & professional!</bi>"
          },
          {
            "heading": "Cloud Computing Solutions...",
            "content": "Proficient in <b>GCP</b> and <b>AWS</b> services. Ready to design cloud infrastructure that is <bi>cost-effective and scalable</bi>, and easy to expand as your business grows."
          },
          {
            "heading": "WORDPRESS services available",
            "content": "Fast websites, captivating designs! <bi>Custom themes</bi>, SEO optimization, & lag-free performance. Perfect for business profiles/portfolios. Turnkey solutions, ready for admin use. Contact the <blot>editorial desk</blot>!"
          }
        ]
      },
      "softskills": {
        "title": "Soft Skills",
        "headline": "Announcements and Notices",
        "items": [
          {
            "heading": "Ready to Learn, Set to Shift",
            "content": "Driven by high curiosity. <biu>Learns fast, adapts faster</biu>. New frameworks, new teams, or unfamiliar domains are not obstacles—they are challenges."
          },
          {
            "heading": "This Engineer Is A CRITICAL Thinker",
            "content": "A sharp engineer capable of <b>analyzing logically and realistically</b>. Identifies risks before they occur and spots the dots that others sometimes miss."
          },
          {
            "heading": "Seeing What Others Skip",
            "content": "<bi>Attention to detail</bi> is paramount! This individual notices the <biu>'technical'</biu> nuances often ignored. Code consistency and neat structures <blot>are the standard</blot>..."
          },
          {
            "heading": "LANGUAGE PROFICIENCY",
            "content": "Ready for global teams. Fluent in Indonesian & English. <filler>Bridging the gap</filler> in technical communication across time zones."
          }
        ]
      }
    },
    "tools": {
      "title": "Tech and Tools",
      "headline": "Stamp Exchange",
      "intro": "<i>Stamps available for trade. Let’s trade, with project role, your ideas, or real work.</i>",
      "footer": "Present your offer at the <faded><blurred>editorial desk</blurred></faded>! Good stamps never go out of circulation"
    }
  }
}
